In [2]:
import numpy as np
import pandas as pd

# 4.1.1 문제

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["제주", "영광", "인천", "대구"])
s

제주    9904312
영광    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
s2 = pd.Series({"제주":9631482,"영광":3393191,"인천":2632035,"대전":1490158},
                index=["제주", "영광", "인천", "대전"])
s2

제주    9631482
영광    3393191
인천    2632035
대전    1490158
dtype: int64

In [5]:
c = s + s2
c

대구           NaN
대전           NaN
영광     6841928.0
인천     5522486.0
제주    19535794.0
dtype: float64

In [6]:
d = s - s2
d

대구         NaN
대전         NaN
영광     55546.0
인천    258416.0
제주    272830.0
dtype: float64

In [7]:
e = s * s2
e

대구             NaN
대전             NaN
영광    1.170222e+13
인천    7.607768e+12
제주    9.539320e+13
dtype: float64

In [8]:
f = s/s2
f

대구         NaN
대전         NaN
영광    1.016370
인천    1.098181
제주    1.028327
dtype: float64

# 4.1.2 문제

In [9]:
# Example
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [10]:
data = {
    "2016": [110,89,106,98,100],
    "2017": [112,79,85,100,98],
    "2018": [114,99,85,87,46],
    "2019": [87,90,95,98,100],
    "2020": [98,100,90,107,93],
    "지역" : ["서부","남부","동부","동부","남부"],
    "2016-2020 평균 승리 " : [88.71,90.54,84.24,99.65,84.15]
}
columns = ["지역","2016","2017","2018","2019","2020","2016-2020 평균 승리 "]
index = ["골스","피닉스","클리퍼스","레이커스","멤피스"]
df = pd.DataFrame(data, index=index, columns = columns)
df

      지역  2016  2017  2018  2019  2020  2016-2020 평균 승리
골스    서부   110   112   114    87    98             88.71
피닉스   남부    89    79    99    90   100             90.54
클리퍼스  동부   106    85    85    95    90             84.24
레이커스  동부    98   100    87    98   107             99.65
멤피스   남부   100    98    46   100    93             84.15

# 4.1.3 문제

In [11]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [12]:
# 1
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [13]:
# 2
del df['수학']
df

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [14]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [15]:
# 3
df["평균"] = df.mean(axis=1).round(4)
df

    국어  영어  수학       평균
춘향  80  90  90  86.6667
몽룡  90  70  60  73.3333
향단  70  60  80  70.0000
방자  30  40  70  46.6667

In [16]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [17]:
#4
df["영어"]["방자"] = 80
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [18]:
df["평균"] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [22]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [25]:
df['국어']

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [ ]:
#5
df[['국어','영어','수학']][:'춘향']

    국어  영어  수학
춘향  80  90  90

In [ ]:
#6
df.loc["향단"]

국어    70
영어    60
수학    80
Name: 향단, dtype: int64

# 4.3.1 문제

In [ ]:
np.random.seed(2020)
df2 = pd.DataFrame(np.random.randint(60,101,25).reshape(5,5),
                    columns = ["국어","영어","수학","과학","코딩"],
                    index = ["노형초","백록초","신광초","한라초","외도초"])
df2

     국어  영어  수학  과학  코딩
노형초  92  68  63  63  87
백록초  63  67  89  92  84
신광초  70  69  71  63  98
한라초  65  88  80  68  98
외도초  80  61  61  75  65

In [ ]:
df2[['국어']]

     국어
노형초  92
백록초  63
신광초  70
한라초  65
외도초  80

In [ ]:
df2.loc[['노형초']]

     국어  영어  수학  과학  코딩
노형초  92  68  63  63  87

In [ ]:
df2.iloc[[3]]

     국어  영어  수학  과학  코딩
한라초  65  88  80  68  98

In [ ]:
df2.loc['백록초']

국어    63
영어    67
수학    89
과학    92
코딩    84
Name: 백록초, dtype: int32

In [ ]:
df2[['국어','영어','수학']][:'백록초']

     국어  영어  수학
노형초  92  68  63
백록초  63  67  89

In [ ]:
df2[['과학','코딩']][:"신광초"]

     과학  코딩
노형초  63  87
백록초  92  84
신광초  63  98

In [ ]:
df2[['코딩']]

     코딩
노형초  87
백록초  84
신광초  98
한라초  98
외도초  65

In [ ]:
df2.loc['외도초'][0]

80

In [ ]:
df2.loc['외도초'][3]

75

In [ ]:
df2[['수학','코딩']][:'한라초']

     수학  코딩
노형초  63  87
백록초  89  84
신광초  71  98
한라초  80  98